[LWS_Hoplite X2SoldierClassTemplate]
DisplayName="Hoplite"
ClassSummary="The Hoplite is extensively trained in the use of shields, pistols and grenades. They are excellent at protecting their squadmates, as well as punishing enemies that come too close."
LeftAbilityTreeTitle="Knight"
RightAbilityTreeTitle="SWAT"
AbilityTreeTitles[0]="Knight"
AbilityTreeTitles[1]="Viking"
AbilityTreeTitles[2]="SWAT"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

;ALPHABETICAL ORDER
RandomNickNames[0]="Ace of Spades"
RandomNickNames[1]="Atrocity"
RandomNickNames[2]="Backburner"
RandomNickNames[3]="Beatdown"
RandomNickNames[4]="Black Death"
RandomNickNames[5]="Bone Breaker"
RandomNickNames[6]="Cold Blooded"
RandomNickNames[7]="Cold Snap"
RandomNickNames[8]="Cryptkeeper"
RandomNickNames[9]="Death Dealer"
RandomNickNames[10]="Devil"
RandomNickNames[11]="Doom"
RandomNickNames[12]="Dragon"
RandomNickNames[13]="Effigy"
RandomNickNames[14]="Evil Genius"
RandomNickNames[15]="Fallen Angel"
RandomNickNames[16]="Fireball"
RandomNickNames[17]="Gear"
RandomNickNames[18]="Hydra"
RandomNickNames[19]="Ifrit"
RandomNickNames[20]="Jackknife"
RandomNickNames[21]="Jet"
RandomNickNames[22]="Lights Out"
RandomNickNames[23]="Mage"
RandomNickNames[24]="Magma"
RandomNickNames[25]="Minotaur"
RandomNickNames[26]="One-Winged Angel"
RandomNickNames[27]="Pitfall"
RandomNickNames[28]="Plague"
RandomNickNames[29]="Rainfall"
RandomNickNames[30]="Rattlesnake"
RandomNickNames[31]="Rebound"
RandomNickNames[32]="Red Death"
RandomNickNames[33]="Rise"
RandomNickNames[34]="Ripper"
RandomNickNames[35]="Salamander"
RandomNickNames[36]="Scream"
RandomNickNames[37]="Sendoff"
RandomNickNames[38]="Shade"
RandomNickNames[39]="Shakedown"
RandomNickNames[40]="Searing"
RandomNickNames[41]="Shifty"
RandomNickNames[42]="Shots Fired"
RandomNickNames[43]="Singe"
RandomNickNames[44]="Soul Taker"
RandomNickNames[45]="Spectral"
RandomNickNames[46]="Spit Break"
RandomNickNames[47]="Tactical Nuke"
RandomNickNames[48]="Tear Down"
RandomNickNames[49]="Terror"
RandomNickNames[50]="Tombstone"
RandomNickNames[51]="Venomous"
RandomNickNames[52]="Viper"
RandomNickNames[53]="War Dog"
RandomNickNames[54]="Wizard"
RandomNickNames[55]="Wrath"
RandomNickNames[56]="Yeti"
RandomNickNames[57]="Zero"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Demon King"
RandomNickNames_Male[1]="Fireman"
RandomNickNames_Male[2]="Overlord"
RandomNickNames_Male[3]="Papa Wolf"
RandomNickNames_Female[0]="Ember"
RandomNickNames_Female[1]="Empress"
RandomNickNames_Female[2]="Mama Bear"
RandomNickNames_Female[3]="Sorceress"
;ALPHABETICAL ORDER

PhotoboothSoloBLines_Male[0]="He'll build a wall and make ADVENT pay for it!"
PhotoboothSoloBLines_Male[1]="No weak points. No retreat."
PhotoboothSoloBLines_Male[2]="A shield is still a blunt object."
PhotoboothSoloBLines_Male[3]="The best offense is a good defense."

PhotoboothSoloBLines_Female[0]="She'll build a wall and make ADVENT pay for it!"
PhotoboothSoloBLines_Female[1]="No weak points. No retreat."
PhotoboothSoloBLines_Female[2]="A shield is still a blunt object."
PhotoboothSoloBLines_Female[3]="The best offense is a good defense."

[ShieldBashHoplite X2AbilityTemplate]
LocFriendlyName="Shield Rush"
LocHelpText="Charge and bash an enemy with your shield, doing some damage and knocking back the target 2 tiles. Can be used with a dash move and ends the turn."
LocLongDescription="Charge and bash an enemy with your shield, doing some damage and knocking back the target 2 tiles. Always ends the turn when used and can be used with a dash move."
LocFlyOverText="Shield Rush"

[MZDefenseShift X2AbilityTemplate]
LocFriendlyName="Guard Shift"
LocLongDescription="Reduces the <Ability:CLASSNAME/>'s Defense by <Ability:MZShiftDefense/>, but raises the squad's Defense by the same amount."
LocHelpText="Reduces the <Ability:CLASSNAME/>'s Defense, but raises the squad's Defense by the same amount."
LocFlyOverText="Guard Shift"
LocPromotionPopupText="<Bullet/> The <Ability:CLASSNAME/>'s bondmate recieves double the bonus.<br/><Bullet/> Ideal on heavily armoured soldiers in order to make foes favor targeting them."

[F_ProtectAndServe X2AbilityTemplate]
LocFriendlyName="Protect and Serve"
LocFlyOverText="Protect and Serve"
LocLongDescription="Gain a non-movement action point after using One For All or Shield Wall."
LocHelpText="Gain a non-movement action point after using One For All or Shield Wall."
LocPromotionPopupText="<Bullet/> Gain a non-movement action point after using One For All or Shield Wall.<br/><Bullet/> Passive.<br/>"

[IRI_Rider_Aegis X2AbilityTemplate]
LocFriendlyName="Aegis"
LocLongDescription="One For All and Shield Wall now reduce incoming damage by <Ability:AEGIS_DAMAGE_REDUCTION/> and redirects any attacks against nearby allies towards you."
LocHelpText="One For All and Shield Wall now reduce incoming damage by <Ability:AEGIS_DAMAGE_REDUCTION/> and redirects any attacks against nearby allies towards you."
LocPromotionPopupText="<Bullet/> Affects Shield Wall granted by <font color='#0bff9b'>Ballistic Shields</font> and <font color='#0bff9b'>W.A.R. Suits</font>.<br/><Bullet/> Aegis affects allies on directly neighboring tiles. Allies on diagonal tiles are not affected."
LocFlyOverText="Aegis"

[GrimyFlashpoint X2AbilityTemplate]
LocFriendlyName="Flashpoint"
LocHelpText="Gain 1 extra Flashbang for each one you have equipped, and Flashbangs now deal 2 more damage."
LocLongDescription="Gain 1 extra Flashbang for each one you have equipped, and Flashbangs now deal 2 more damage."